{
  "home": "Home",
  "about": "About",
  "education": "Education",
  "projects": "Projects",
  "contact": "Contact",

  "hey": "Hey, I'm",
  "function": "Software Developer",
  "moreButton": "See More",
  "contactMe": "Contact Me",

  "aboutMe": "About Me",
  "paragraph1": "My name is Jurre Blankers, an 18 year old ICT student at the Hogeschool Utrecht. After graduating from havo in 2024, i decided to pursue my passion for technology by starting a bachelor’s degree in ICT.",
  "paragraph2": "I’ve been fascinated by how things work for quite a while now, especially when it comes to computers and coding. programming gives me the creative freedom to build, solve problems, and continuously innovate. It’s something I enjoy both in my study and in my free time.",
  "paragraph3": "Outside of school, I’m active in scouting, which has taught me teamwork, organizing activities for groups, and taking time to relax. I also enjoy gaming, mainly as a way to unwind and have fun with friends. Besides that, I like spending time with friends, whether it’s doing something active or just hanging out. There hobbies help me to stay balanced and give me energy to keep learning and growing as a developer.",
  "paragraph4": "I’m excited about what the future will bring me, and I’m always open to new opportunities to grow, collaborate, and create meaningful digital solutions.",

  "educationPoints": [
    {
      "title": "Dr. Moller College",
      "years": "2019 - 2024",
      "subtitle": "Havo",
      "website": "https://www.drmollercollege.nl/"
    },
    {
      "title":"Hogeschool Utrecht",
      "years": "2024 - now",
      "subtitle": "Bachelor's degree ICT",
      "website": "https://www.hu.nl/voltijd-opleidingen/open-ict"
    }
  ],

  "latestProjects": "Latest Projects",
  "projectsObjects": [
    {
      "id": "1",
      "title": "Test 1",
      "date": "29-06-2025"
    },
    {
      "id": "2",
      "title": "Test 2",
      "date": "30-06-2025"
    },
    {
      "id": "3",
      "title": "Test 3",
      "date": "29-06-2025"
    },
    {
      "id": "4",
      "title": "Test 4",
      "date": "14-07-2025"
    }
  ],

  "contactMessage": "Any questions or remarks? Just write me a message!",
  "Name": "Name",
  "Email": "Email",
  "Message": "Message",
  "Submit": "Submit",

  "copyRights": "Since 2025 - Jurre Blankers"
}