{
  "navigations": {
    "home": "Home",
    "about": "About",
    "education": "Education",
    "projects": "Projects",
    "contact": "Contact"
  },
  "copyRights": "Since 2025 - Jurre Blankers",

  "landingPage": {
    "hey": "Hey, I'm",
    "Jurre": "Jurre Blankers",
    "function": "Software Developer",
    "moreButton": "See More",
    "contactMe": "Contact Me",
    "aboutMe": "About Me",
    "paragraph1": "My name is Jurre Blankers, an 18 year old ICT student at the Hogeschool Utrecht. After graduating from havo in 2024, i decided to pursue my passion for technology by starting a bachelor’s degree in ICT.",
    "paragraph2": "I’ve been fascinated by how things work for quite a while now, especially when it comes to computers and coding. programming gives me the creative freedom to build, solve problems, and continuously innovate. It’s something I enjoy both in my study and in my free time.",
    "paragraph3": "Outside of school, I’m active in scouting, which has taught me teamwork, organizing activities for groups, and taking time to relax. I also enjoy gaming, mainly as a way to unwind and have fun with friends. Besides that, I like spending time with friends, whether it’s doing something active or just hanging out. There hobbies help me to stay balanced and give me energy to keep learning and growing as a developer.",
    "paragraph4": "I’m excited about what the future will bring me, and I’m always open to new opportunities to grow, collaborate, and create meaningful digital solutions."
  },

  "education": "Education",
  "educationPoints": [
    {
      "title": "Dr. Moller College",
      "years": "2019 - 2024",
      "subtitle": "Havo",
      "website": "https://www.drmollercollege.nl/"
    },
    {
      "title": "Hogeschool Utrecht",
      "years": "2024 - now",
      "subtitle": "Bachelor's degree ICT",
      "website": "https://www.hu.nl/voltijd-opleidingen/open-ict"
    }
  ],

  "projects": "Projects",
  "latestProjects": "Latest Projects",
  "projectsObjects": [
    {
      "id": "1",
      "title": "Δυµαχω",
      "subtitle": "From Paper to Platform",
      "description": "This project was carried out during the second semester of the first year of our studies at the Utrecht University of Applied Sciences, in collaboration with a team of five students. The problem statement was provided by the company Dumaco Oss. Although we were not yet allowed to actively collaborate with external companies at that stage, their case served as the foundation for our project. As a result, we chose our own project name, inspired by the name Dumaco in Ancient Greek.\n\nThe goal of the project was to optimize internal processes at Dumaco, with a specific focus on the order slip process. At the time, this process was still entirely paper-based, which often led to inefficiencies and errors. Our solution involved digitizing the process by developing a custom web application with an integrated database. Additionally, there was limited visibility into the location of products and their corresponding pallets within the factory. We conducted research into potential solutions for this issue as well and developed a proof of concept.\n\nThroughout the project, we worked with many new technologies. As a result, we built a solution that lacked a solid foundation, but this also provided valuable learning experiences. We reflected on this and identified concrete areas for improvement to apply in future projects. For the technical implementation, we used React for the frontend, and Node.js with JavaScript and a MySQL database for the backend.",
      "image": "dumaco.png",
      "url": "https://github.com/chevyje/Dumaco",
      "date": "06-02-2025"
    },
    {
      "id": "2",
      "title": "Party Plaza",
      "subtitle": "A minecraft project",
      "description": "Party Plaza is a hobby project I started with a friend, focused on creating a Minecraft server featuring multiple minigames in a tournament format. The goal is to provide a flexible environment where players can sign up for tournaments and experience a variety of games, from PvP battles to puzzle challenges.\n\nThe project is built in Java using Maven, with a main plugin managing all minigames. A key technical feature is the two-way communication between the main plugin and the minigames, allowing the main plugin to start games and manage teams, while minigames can send information back. This modular approach ensures that minigames can operate independently but are still centrally controlled.\n\nCurrently, the first test runs have been completed with two minigames. The final plan is to implement six games with a rotation system to keep each tournament unique. While I develop most of the project myself, my friend contributed to setting up the initial framework and acquiring essential knowledge.\n\nFuture plans include expanding Party Plaza with new minigames and features, leveraging the modular design for easy maintenance and adaptation. This project demonstrates my skills in Java development, plugin architecture, and creating scalable, modular systems.",
      "image": "party_plaza.png",
      "url": "",
      "date": "10-03-2025"
    },
    {
      "id": "3",
      "title": "Portfolio Website",
      "subtitle": "Showcasing my work and skills",
      "description": "This portfolio website is a personal project I built entirely on my own to provide a comprehensive overview of my professional profile. The website is designed to showcase my CV, completed projects, and educational background, while offering visitors a clear and structured way to explore my work and skills.\n\nTechnically, the site is built using React with TypeScript, ensuring a modern, component-based architecture. One of the key design choices was to structure all content through JSON files, enabling easy updates, additions, and translations without modifying the core codebase. Each language version is fully supported via separate JSON configurations, allowing seamless multilingual functionality and dynamic content rendering.\n\nThe website emphasizes modularity, maintainability, and scalability. Projects and other sections are dynamically loaded from the JSON data, reducing duplication and improving consistency across the site. This approach not only streamlines content management but also demonstrates best practices in structuring a React application for flexibility and future expansion.\n\nBuilding this project allowed me to strengthen my skills in React, TypeScript, and JSON-driven dynamic architectures, while creating a practical platform to present my portfolio in a professional and user-friendly way. The site is fully adaptable, maintainable, and ready to grow as my skills and projects evolve.",
      "image": "portfolio.png",
      "url": "https://github.com/chevyje/Portfolio",
      "date": "30-06-2025"
    }
  ],

  "contactPage": {
    "contactMe": "Contact Me",
    "contactMessage": "Any questions or remarks? Just write me a message!",
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "submit": "Submit",

    "phone number": "+31-625581200",
    "mail": "jurre.blankers@gmail.com"
  },

  "errorPage": {
    "title": "404",
    "subtitle": "Page not found!",
    "message": "The page you tried to visit does not exists. \nPlease go back to the home page using the button below or try another url.",
    "button": "Home"
  },

  "ErrorMessages": {
    "Invalid": {
      "Name": "This name is too short or invalid!",
      "Email": "This email is invalid!",
      "Message": "The message is too short or invalid!"
    }
  }
}